In [1]:
import numpy as np
import pandas as pd

In [2]:
date = pd.read_csv("/home/yash/Downloads/orders.csv")
time = pd.read_csv("/home/yash/Downloads/messages.csv")

In [3]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [4]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [5]:
date.info()
# here date is object so we have to convert in datetime

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [6]:
time.info()
# here date is object so we have to convert in datetime

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [7]:
# Concert Date in datetime datatype
date["date"] = pd.to_datetime(date["date"])
time["date"] = pd.to_datetime(time["date"])

In [8]:
date.head()

        date  product_id  city_id  orders
0 2019-12-10        5628       25       3
1 2018-08-15        3646       14     157
2 2018-10-23        1859       25       1
3 2019-08-17        7292       25       1
4 2019-01-06        4344       25       3

In [9]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

## Working on Date

In [10]:
# 1. Extract Year

date["year"] = date["date"].dt.year
date.head()

        date  product_id  city_id  orders  year
0 2019-12-10        5628       25       3  2019
1 2018-08-15        3646       14     157  2018
2 2018-10-23        1859       25       1  2018
3 2019-08-17        7292       25       1  2019
4 2019-01-06        4344       25       3  2019

In [11]:
# 2. Extract Month

date["month"] = date["date"].dt.month
date.head()

        date  product_id  city_id  orders  year  month
0 2019-12-10        5628       25       3  2019     12
1 2018-08-15        3646       14     157  2018      8
2 2018-10-23        1859       25       1  2018     10
3 2019-08-17        7292       25       1  2019      8
4 2019-01-06        4344       25       3  2019      1

In [12]:
date["month_name"] = date["date"].dt.month_name()
date.head()

        date  product_id  city_id  orders  year  month month_name
0 2019-12-10        5628       25       3  2019     12   December
1 2018-08-15        3646       14     157  2018      8     August
2 2018-10-23        1859       25       1  2018     10    October
3 2019-08-17        7292       25       1  2019      8     August
4 2019-01-06        4344       25       3  2019      1    January

In [13]:
# 3. Extract Day

date["day"] = date["date"].dt.day
date.head()

        date  product_id  city_id  orders  year  month month_name  day
0 2019-12-10        5628       25       3  2019     12   December   10
1 2018-08-15        3646       14     157  2018      8     August   15
2 2018-10-23        1859       25       1  2018     10    October   23
3 2019-08-17        7292       25       1  2019      8     August   17
4 2019-01-06        4344       25       3  2019      1    January    6

In [14]:
date["day_of_week"] = date["date"].dt.day_of_week
date.head()

,date,product_id,city_id,orders,year,month,month_name,day,day_of_week
0,2019-12-10,5628,25,3,2019,12,December,10,1
1,2018-08-15,3646,14,157,2018,8,August,15,2
2,2018-10-23,1859,25,1,2018,10,October,23,1
3,2019-08-17,7292,25,1,2019,8,August,17,5
4,2019-01-06,4344,25,3,2019,1,January,6,6

In [15]:
date["name_of_day"] = date["date"].dt.day_name()
date.head()

,date,product_id,city_id,orders,year,month,month_name,day,day_of_week,name_of_day
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday

In [16]:
date["day_of year"] = date["date"].dt.day_of_year
date.head()

,date,product_id,city_id,orders,year,month,month_name,day,day_of_week,name_of_day,day_of year
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,344
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,227
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,296
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,229
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,6

In [17]:
# is weekend...??

date["weekend..??"] = np.where(date["name_of_day"].isin(["Saturday","Sunday"]),"Yes","No")
date.head()

,date,product_id,city_id,orders,year,month,month_name,day,day_of_week,name_of_day,day_of year,weekend..??
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,344,No
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,227,No
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,296,No
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,229,Yes
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,6,Yes

In [18]:
# 4. Extract Week of the Year

date["week_of_year"] = date["date"].dt.isocalendar().week
date.head()

,date,product_id,city_id,orders,year,month,month_name,day,day_of_week,name_of_day,day_of year,weekend..??,week_of_year
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,344,No,50
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,227,No,33
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,296,No,43
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,229,Yes,33
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,6,Yes,1

In [19]:
# 5. Extract Quarter

date["quarter"] = date["date"].dt.quarter
# A quarter is simply a way to divide a full year into four parts, each part being 3 months.
date.drop(columns=["product_id","city_id","orders"]).head()

,date,year,month,month_name,day,day_of_week,name_of_day,day_of year,weekend..??,week_of_year,quarter
0,2019-12-10,2019,12,December,10,1,Tuesday,344,No,50,4
1,2018-08-15,2018,8,August,15,2,Wednesday,227,No,33,3
2,2018-10-23,2018,10,October,23,1,Tuesday,296,No,43,4
3,2019-08-17,2019,8,August,17,5,Saturday,229,Yes,33,3
4,2019-01-06,2019,1,January,6,6,Sunday,6,Yes,1,1

In [20]:
# Semister 1 or 2..??

date["semister"] = np.where(date["quarter"].isin([1,2]),1,2)
date.drop(columns=["product_id","city_id","orders"]).head()

,date,year,month,month_name,day,day_of_week,name_of_day,day_of year,weekend..??,week_of_year,quarter,semister
0,2019-12-10,2019,12,December,10,1,Tuesday,344,No,50,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,227,No,33,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,296,No,43,4,2
3,2019-08-17,2019,8,August,17,5,Saturday,229,Yes,33,3,2
4,2019-01-06,2019,1,January,6,6,Sunday,6,Yes,1,1,1

In [21]:
# Extract Time elapsed between dates

import datetime

today = datetime.datetime.today()

today

datetime.datetime(2025, 11, 14, 11, 18, 16, 953294)

In [22]:
today - date["date"].head()

0   2166 days 11:18:16.953294
1   2648 days 11:18:16.953294
2   2579 days 11:18:16.953294
3   2281 days 11:18:16.953294
4   2504 days 11:18:16.953294
Name: date, dtype: timedelta64[ns]

In [23]:
(today - date["date"]).dt.days.head()

0    2166
1    2648
2    2579
3    2281
4    2504
Name: date, dtype: int64

## Working on Time

In [24]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [37]:
time["hour"] = time["date"].dt.hour
time["min"] = time["date"].dt.minute
time["sec"] = time["date"].dt.second
time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0